# GetWallCapAttributesType

## Description
Gets the wall cap attributes type of a wall or round wall.  The wall cap attributes type determines whether the wall caps have the wall line attributes or the component lines attributes.  If they have the component lines attributes, each wall component is capped with its own left line attributes.

```pascal
FUNCTION GetWallCapAttributesType(wall : HANDLE) : INTEGER;
```

```python

def vs.GetWallCapAttributesType(wall):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wall|HANDLE|The handle to the wall or round wall.|

## Returns
The wall cap attributes type.<BR>
<BR>
0 - The wall cap attributes are the wall line attributes<BR>
1 - The wall cap attributes are the wall component lines attributes

## See Also
VS Functions:
SetWallCapAttributesType

## Version
Availability: from Vectorworks 2010
## Category
* Objects - Walls